cases/cfd-turbine/fluid/system/mapFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                      |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      mapFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mapFieldsCoeffs
{
    source cellSet turbine;  // Specify the name of your cell set
    source timeStep 0;

    target patches ("turbinePatch");
    target timeStep 0;

    interpolationScheme cellPoint;  // Choose the interpolation scheme as needed
}

// ************************************************************************* //

