cases/cfd-turbine/fluid/system/preCICE_Adapter
// -*- C++ -*-

type preciceAdapterFunctionObject;
libs ("libpreciceAdapterFunctionObject.so");


// ************************************************************************* //