cases/cfd-turbine/fluid/system/preciceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FF FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    locations         volumeCenters;
    cellSets          (turbine);
    patches           ();
    
    readData
    (
    //  Force
    );
    
    writeData
    (
      Velocity
    );
  }; 
};

FF
{
  nameU     U;
}

FSI
{

}

// ************************************************************************* //
